### CHAPTER 11
# Time Series

In [236]:
import numpy as np
import pandas as pd

In [237]:
pd.__version__

'2.3.3'

## 11.1 Date and Time Data Types and Tools

In [238]:
from datetime import datetime
now = datetime.now()
now

datetime.datetime(2026, 1, 5, 21, 26, 41, 616623)

In [239]:
now.year, now.month, now.day, now.hour, now.minute, now.second

(2026, 1, 5, 21, 26, 41)

In [240]:
delta = datetime(2011, 1, 7) - datetime(2008, 6, 24, 8, 15)
delta

datetime.timedelta(days=926, seconds=56700)

In [241]:
delta.days

926

In [242]:
delta.seconds

56700

In [243]:
from datetime import timedelta
start = datetime(2011, 1, 7)
start + timedelta(12)

datetime.datetime(2011, 1, 19, 0, 0)

In [244]:
start - 2 * timedelta(12)

datetime.datetime(2010, 12, 14, 0, 0)

### Converting Between String and Datetime

In [245]:
stamp = datetime(2011, 1, 3)
str(stamp)

'2011-01-03 00:00:00'

In [246]:
stamp.strftime("%Y-%m-%d")

'2011-01-03'

In [247]:
value = '2011-01-03'
datetime.strptime(value, "%Y-%m-%d")

datetime.datetime(2011, 1, 3, 0, 0)

In [248]:
datestrs = ["2011-07-06 12:00:00", "2011-08-06 00:00:00"]
pd.to_datetime(datestrs)

DatetimeIndex(['2011-07-06 12:00:00', '2011-08-06 00:00:00'], dtype='datetime64[ns]', freq=None)

In [249]:
idx = pd.to_datetime(datestrs + [None])
idx

DatetimeIndex(['2011-07-06 12:00:00', '2011-08-06 00:00:00', 'NaT'], dtype='datetime64[ns]', freq=None)

In [250]:
idx[2]

NaT

In [251]:
pd.isna(idx)

array([False, False,  True])

## 11.2 Time Series Basics

In [252]:
data = [datetime(2011, 1, 2), datetime(2011, 1, 5), datetime(2011, 1, 7),
        datetime(2011, 1, 8), datetime(2011, 1, 10), datetime(2011, 1, 12)]

In [253]:
ts = pd.Series(np.random.standard_normal(6), index=data)
ts

2011-01-02    0.651293
2011-01-05   -1.149511
2011-01-07   -1.317080
2011-01-08   -0.056600
2011-01-10    0.200258
2011-01-12    0.154209
dtype: float64

In [254]:
ts.index

DatetimeIndex(['2011-01-02', '2011-01-05', '2011-01-07', '2011-01-08',
               '2011-01-10', '2011-01-12'],
              dtype='datetime64[ns]', freq=None)

In [255]:
ts + ts[::2]

2011-01-02    1.302586
2011-01-05         NaN
2011-01-07   -2.634160
2011-01-08         NaN
2011-01-10    0.400515
2011-01-12         NaN
dtype: float64

In [256]:
ts.index.dtype

dtype('<M8[ns]')

In [257]:
stamp = ts.index[0]
stamp

Timestamp('2011-01-02 00:00:00')

### Indexing, Selection, Subsetting

In [258]:
stamp = ts.index[2]
ts[stamp]

np.float64(-1.3170800935146763)

In [259]:
ts["2011-01-10"]

np.float64(0.20025756234326736)

In [260]:
longer_ts = pd.Series(np.random.standard_normal(1000),
                      index=pd.date_range("2000-01-01", periods=1000))
longer_ts

2000-01-01   -0.683653
2000-01-02   -0.423160
2000-01-03   -0.287036
2000-01-04    1.714681
2000-01-05    0.611495
                ...
2002-09-22    0.195582
2002-09-23   -0.045075
2002-09-24   -1.164611
2002-09-25   -0.087880
2002-09-26    0.860048
Freq: D, Length: 1000, dtype: float64

In [261]:
longer_ts["2001"]

2001-01-01   -0.800570
2001-01-02   -0.969699
2001-01-03    2.395423
2001-01-04   -0.855525
2001-01-05    0.171046
                ...
2001-12-27    0.968841
2001-12-28   -0.657634
2001-12-29    0.843850
2001-12-30   -0.339675
2001-12-31    0.192429
Freq: D, Length: 365, dtype: float64

In [262]:
longer_ts["2001-05"]

2001-05-01    0.197911
2001-05-02    1.207507
2001-05-03    0.684773
2001-05-04   -0.970421
2001-05-05   -0.328902
2001-05-06    0.407477
2001-05-07   -0.769189
2001-05-08    1.927505
2001-05-09    0.386871
2001-05-10   -0.358815
2001-05-11    0.800215
2001-05-12   -1.208497
2001-05-13   -0.711849
2001-05-14   -0.086836
2001-05-15   -2.064330
2001-05-16   -1.352435
2001-05-17   -1.358335
2001-05-18   -0.674110
2001-05-19    1.692828
2001-05-20   -0.876257
2001-05-21   -0.396890
2001-05-22    1.600099
2001-05-23   -0.186073
2001-05-24   -1.404905
2001-05-25   -0.349094
2001-05-26    0.909396
2001-05-27    1.507142
2001-05-28   -0.456186
2001-05-29   -1.152445
2001-05-30   -0.747955
2001-05-31    0.150037
Freq: D, dtype: float64

In [263]:
ts[datetime(2011, 1, 7):datetime(2011, 1, 10)]

2011-01-07   -1.317080
2011-01-08   -0.056600
2011-01-10    0.200258
dtype: float64

In [264]:
ts

2011-01-02    0.651293
2011-01-05   -1.149511
2011-01-07   -1.317080
2011-01-08   -0.056600
2011-01-10    0.200258
2011-01-12    0.154209
dtype: float64

In [265]:
ts["2011-01-06":"2011-01-11"]

2011-01-07   -1.317080
2011-01-08   -0.056600
2011-01-10    0.200258
dtype: float64

In [266]:
ts.truncate(after="2011-01-09")

2011-01-02    0.651293
2011-01-05   -1.149511
2011-01-07   -1.317080
2011-01-08   -0.056600
dtype: float64

In [267]:
ts

2011-01-02    0.651293
2011-01-05   -1.149511
2011-01-07   -1.317080
2011-01-08   -0.056600
2011-01-10    0.200258
2011-01-12    0.154209
dtype: float64

In [268]:
dates = pd.date_range("2000-01-01", periods=100, freq="W-WED")
long_df = pd.DataFrame(np.random.standard_normal((100, 4)),
                       index=dates,
                       columns=["Colorado", "Texas", "New York", "Ohio"])
long_df.loc["2001-05"]

            Colorado     Texas  New York      Ohio
2001-05-02 -0.452661  1.133685  0.748078 -0.052755
2001-05-09  0.148271 -2.703398 -0.530804 -0.138938
2001-05-16 -1.582852 -0.681750  0.407998  0.932197
2001-05-23  0.574899 -1.324252 -0.648958 -0.200504
2001-05-30  0.980217  0.362667 -1.267085 -0.631104

### Time Series with Duplicate Indices

In [269]:
dates = pd.DatetimeIndex(["2000-01-01", "2000-01-02", "2000-01-02",
                          "2000-01-02", "2000-01-03"])
dup_ts = pd.Series(np.arange(5), index=dates)
dup_ts

2000-01-01    0
2000-01-02    1
2000-01-02    2
2000-01-02    3
2000-01-03    4
dtype: int64

In [270]:
dup_ts.index.is_unique

False

In [271]:
dup_ts["2000-01-03"]

np.int64(4)

In [272]:
dup_ts["2000-01-02"]

2000-01-02    1
2000-01-02    2
2000-01-02    3
dtype: int64

In [273]:
grouped = dup_ts.groupby(level=0)
grouped.mean()

2000-01-01    0.0
2000-01-02    2.0
2000-01-03    4.0
dtype: float64

In [274]:
grouped.count()

2000-01-01    1
2000-01-02    3
2000-01-03    1
dtype: int64

## 11.3 Date Ranges, Frequencies, and Shifting

In [275]:
ts

2011-01-02    0.651293
2011-01-05   -1.149511
2011-01-07   -1.317080
2011-01-08   -0.056600
2011-01-10    0.200258
2011-01-12    0.154209
dtype: float64

In [276]:
resampler = ts.resample("D")  # The string "D" is interpreted as daily frequency.
resampler

In [277]:
resampler.mean()

2011-01-02    0.651293
2011-01-03         NaN
2011-01-04         NaN
2011-01-05   -1.149511
2011-01-06         NaN
2011-01-07   -1.317080
2011-01-08   -0.056600
2011-01-09         NaN
2011-01-10    0.200258
2011-01-11         NaN
2011-01-12    0.154209
Freq: D, dtype: float64

### Generating Date Ranges

In [278]:
index = pd.date_range("2012-04-01", "2012-06-01")
index

DatetimeIndex(['2012-04-01', '2012-04-02', '2012-04-03', '2012-04-04',
               '2012-04-05', '2012-04-06', '2012-04-07', '2012-04-08',
               '2012-04-09', '2012-04-10', '2012-04-11', '2012-04-12',
               '2012-04-13', '2012-04-14', '2012-04-15', '2012-04-16',
               '2012-04-17', '2012-04-18', '2012-04-19', '2012-04-20',
               '2012-04-21', '2012-04-22', '2012-04-23', '2012-04-24',
               '2012-04-25', '2012-04-26', '2012-04-27', '2012-04-28',
               '2012-04-29', '2012-04-30', '2012-05-01', '2012-05-02',
               '2012-05-03', '2012-05-04', '2012-05-05', '2012-05-06',
               '2012-05-07', '2012-05-08', '2012-05-09', '2012-05-10',
               '2012-05-11', '2012-05-12', '2012-05-13', '2012-05-14',
               '2012-05-15', '2012-05-16', '2012-05-17', '2012-05-18',
               '2012-05-19', '2012-05-20', '2012-05-21', '2012-05-22',
               '2012-05-23', '2012-05-24', '2012-05-25', '2012-05-26',
               '2012-05-27', '2012-05-28', '2012-05-29', '2012-05-30',
               '2012-05-31', '2012-06-01'],
              dtype='datetime64[ns]', freq='D')

In [279]:
pd.date_range(start="2012-04-01", periods=20)

DatetimeIndex(['2012-04-01', '2012-04-02', '2012-04-03', '2012-04-04',
               '2012-04-05', '2012-04-06', '2012-04-07', '2012-04-08',
               '2012-04-09', '2012-04-10', '2012-04-11', '2012-04-12',
               '2012-04-13', '2012-04-14', '2012-04-15', '2012-04-16',
               '2012-04-17', '2012-04-18', '2012-04-19', '2012-04-20'],
              dtype='datetime64[ns]', freq='D')

In [280]:
pd.date_range(end="2012-06-01", periods=20)

DatetimeIndex(['2012-05-13', '2012-05-14', '2012-05-15', '2012-05-16',
               '2012-05-17', '2012-05-18', '2012-05-19', '2012-05-20',
               '2012-05-21', '2012-05-22', '2012-05-23', '2012-05-24',
               '2012-05-25', '2012-05-26', '2012-05-27', '2012-05-28',
               '2012-05-29', '2012-05-30', '2012-05-31', '2012-06-01'],
              dtype='datetime64[ns]', freq='D')

In [281]:
pd.date_range("2000-01-01", "2000-12-01", freq="BM")  # Business month end frequency

C:\Users\sahor\AppData\Local\Temp\ipykernel_19904\2781953853.py:1: FutureWarning: 'BM' is deprecated and will be removed in a future version, please use 'BME' instead.
  pd.date_range("2000-01-01", "2000-12-01", freq="BM")  # Business month end frequency

DatetimeIndex(['2000-01-31', '2000-02-29', '2000-03-31', '2000-04-28',
               '2000-05-31', '2000-06-30', '2000-07-31', '2000-08-31',
               '2000-09-29', '2000-10-31', '2000-11-30'],
              dtype='datetime64[ns]', freq='BME')

In [282]:
pd.date_range("2012-05-02 12:56:31", periods=5)

DatetimeIndex(['2012-05-02 12:56:31', '2012-05-03 12:56:31',
               '2012-05-04 12:56:31', '2012-05-05 12:56:31',
               '2012-05-06 12:56:31'],
              dtype='datetime64[ns]', freq='D')

In [283]:
pd.date_range("2012-05-02 12:56:31", periods=5, normalize=True)

DatetimeIndex(['2012-05-02', '2012-05-03', '2012-05-04', '2012-05-05',
               '2012-05-06'],
              dtype='datetime64[ns]', freq='D')

### Frequencies and Date Offsets

In [284]:
from pandas.tseries.offsets import Hour, Minute
hour = Hour()
hour

In [285]:
four_hours = Hour(4)
four_hours

In [286]:
pd.date_range("2000- 01-01", "2000-01-03 23:59", freq="4H")

C:\Users\sahor\AppData\Local\Temp\ipykernel_19904\3173807497.py:1: FutureWarning: 'H' is deprecated and will be removed in a future version, please use 'h' instead.
  pd.date_range("2000- 01-01", "2000-01-03 23:59", freq="4H")

DatetimeIndex(['2000-01-01 00:00:00', '2000-01-01 04:00:00',
               '2000-01-01 08:00:00', '2000-01-01 12:00:00',
               '2000-01-01 16:00:00', '2000-01-01 20:00:00',
               '2000-01-02 00:00:00', '2000-01-02 04:00:00',
               '2000-01-02 08:00:00', '2000-01-02 12:00:00',
               '2000-01-02 16:00:00', '2000-01-02 20:00:00',
               '2000-01-03 00:00:00', '2000-01-03 04:00:00',
               '2000-01-03 08:00:00', '2000-01-03 12:00:00',
               '2000-01-03 16:00:00', '2000-01-03 20:00:00'],
              dtype='datetime64[ns]', freq='4h')

In [287]:
Hour(2) + Minute(30)

In [288]:
pd.date_range("2000-01-01", periods=10, freq="1h30min")

DatetimeIndex(['2000-01-01 00:00:00', '2000-01-01 01:30:00',
               '2000-01-01 03:00:00', '2000-01-01 04:30:00',
               '2000-01-01 06:00:00', '2000-01-01 07:30:00',
               '2000-01-01 09:00:00', '2000-01-01 10:30:00',
               '2000-01-01 12:00:00', '2000-01-01 13:30:00'],
              dtype='datetime64[ns]', freq='90min')

#### Week of month dates

In [289]:
monthly_dates = pd.date_range("2012-01-01", "2012-09-01", freq="WOM-3FRI")
list(monthly_dates)

[Timestamp('2012-01-20 00:00:00'),
 Timestamp('2012-02-17 00:00:00'),
 Timestamp('2012-03-16 00:00:00'),
 Timestamp('2012-04-20 00:00:00'),
 Timestamp('2012-05-18 00:00:00'),
 Timestamp('2012-06-15 00:00:00'),
 Timestamp('2012-07-20 00:00:00'),
 Timestamp('2012-08-17 00:00:00')]

### Shifting (Leading and Lagging) Data

In [290]:
ts = pd.Series(np.random.standard_normal(4),
               index=pd.date_range("2000-01-01", periods=4, freq="ME"))
ts

2000-01-31   -0.258037
2000-02-29   -0.212117
2000-03-31    0.746713
2000-04-30    0.677213
Freq: ME, dtype: float64

In [291]:
ts.shift(2)

2000-01-31         NaN
2000-02-29         NaN
2000-03-31   -0.258037
2000-04-30   -0.212117
Freq: ME, dtype: float64

In [292]:
ts.shift(-2)

2000-01-31    0.746713
2000-02-29    0.677213
2000-03-31         NaN
2000-04-30         NaN
Freq: ME, dtype: float64

In [293]:
ts

2000-01-31   -0.258037
2000-02-29   -0.212117
2000-03-31    0.746713
2000-04-30    0.677213
Freq: ME, dtype: float64

In [294]:
ts / ts.shift(1) - 1

2000-01-31         NaN
2000-02-29   -0.177958
2000-03-31   -4.520282
2000-04-30   -0.093074
Freq: ME, dtype: float64

In [295]:
ts.shift(2, freq="ME")

2000-03-31   -0.258037
2000-04-30   -0.212117
2000-05-31    0.746713
2000-06-30    0.677213
Freq: ME, dtype: float64

In [296]:
ts.shift(3, freq="D")

2000-02-03   -0.258037
2000-03-03   -0.212117
2000-04-03    0.746713
2000-05-03    0.677213
dtype: float64

In [297]:
ts.shift(1, freq="90min")

2000-01-31 01:30:00   -0.258037
2000-02-29 01:30:00   -0.212117
2000-03-31 01:30:00    0.746713
2000-04-30 01:30:00    0.677213
dtype: float64

### Shifting dates with offsets

In [298]:
from pandas.tseries.offsets import Day, MonthEnd
now = datetime(2011, 11, 17)
now + 3 * Day()

Timestamp('2011-11-20 00:00:00')

In [299]:
now + MonthEnd()

Timestamp('2011-11-30 00:00:00')

In [300]:
offset = MonthEnd()
offset.rollforward(now)

Timestamp('2011-11-30 00:00:00')

In [301]:
offset.rollback(now)

Timestamp('2011-10-31 00:00:00')

In [302]:
ts = pd.Series(np.random.standard_normal(20),
               index=pd.date_range("2000-01-15", periods=20, freq="4D"))
ts

2000-01-15    0.846060
2000-01-19    0.121059
2000-01-23    1.142875
2000-01-27    2.515983
2000-01-31   -0.450940
2000-02-04    1.406087
2000-02-08    0.833148
2000-02-12   -0.005847
2000-02-16   -2.152010
2000-02-20    0.468911
2000-02-24    0.004842
2000-02-28   -0.857970
2000-03-03   -0.736200
2000-03-07    1.245508
2000-03-11   -1.460293
2000-03-15   -0.071608
2000-03-19    2.092848
2000-03-23    0.327187
2000-03-27    2.342190
2000-03-31   -0.911642
Freq: 4D, dtype: float64

In [303]:
ts.groupby(MonthEnd().rollforward).mean()

2000-01-31    0.835008
2000-02-29   -0.043263
2000-03-31    0.353499
dtype: float64

## 11.4 Time Zone Handling

In [304]:
import pytz
pytz.common_timezones[-5:]

['US/Eastern', 'US/Hawaii', 'US/Mountain', 'US/Pacific', 'UTC']

In [305]:
tz = pytz.timezone("Asia/Dhaka")
tz

### Time Zone Localization and Conversion

In [306]:
dates = pd.date_range("2012-03-09 09:30", periods=6)
ts = pd.Series(np.random.standard_normal(len(dates)), index=dates)
ts

2012-03-09 09:30:00    0.618635
2012-03-10 09:30:00   -0.596717
2012-03-11 09:30:00   -0.199900
2012-03-12 09:30:00    0.662990
2012-03-13 09:30:00    0.151880
2012-03-14 09:30:00    0.006552
Freq: D, dtype: float64

In [307]:
print(ts.index.tz)

None

In [308]:
pd.date_range("2012-03-09 09:30", periods=10, tz="Asia/Dhaka")

DatetimeIndex(['2012-03-09 09:30:00+06:00', '2012-03-10 09:30:00+06:00',
               '2012-03-11 09:30:00+06:00', '2012-03-12 09:30:00+06:00',
               '2012-03-13 09:30:00+06:00', '2012-03-14 09:30:00+06:00',
               '2012-03-15 09:30:00+06:00', '2012-03-16 09:30:00+06:00',
               '2012-03-17 09:30:00+06:00', '2012-03-18 09:30:00+06:00'],
              dtype='datetime64[ns, Asia/Dhaka]', freq='D')

In [309]:
ts

2012-03-09 09:30:00    0.618635
2012-03-10 09:30:00   -0.596717
2012-03-11 09:30:00   -0.199900
2012-03-12 09:30:00    0.662990
2012-03-13 09:30:00    0.151880
2012-03-14 09:30:00    0.006552
Freq: D, dtype: float64

In [310]:
ts_utc = ts.tz_localize("UTC")
ts_utc

2012-03-09 09:30:00+00:00    0.618635
2012-03-10 09:30:00+00:00   -0.596717
2012-03-11 09:30:00+00:00   -0.199900
2012-03-12 09:30:00+00:00    0.662990
2012-03-13 09:30:00+00:00    0.151880
2012-03-14 09:30:00+00:00    0.006552
Freq: D, dtype: float64

In [311]:
ts_dhaka = ts.tz_localize("Asia/Dhaka")
ts_dhaka

2012-03-09 09:30:00+06:00    0.618635
2012-03-10 09:30:00+06:00   -0.596717
2012-03-11 09:30:00+06:00   -0.199900
2012-03-12 09:30:00+06:00    0.662990
2012-03-13 09:30:00+06:00    0.151880
2012-03-14 09:30:00+06:00    0.006552
dtype: float64

In [312]:
ts_dhaka.index

DatetimeIndex(['2012-03-09 09:30:00+06:00', '2012-03-10 09:30:00+06:00',
               '2012-03-11 09:30:00+06:00', '2012-03-12 09:30:00+06:00',
               '2012-03-13 09:30:00+06:00', '2012-03-14 09:30:00+06:00'],
              dtype='datetime64[ns, Asia/Dhaka]', freq=None)

In [313]:
ts_kolkata = ts_dhaka.tz_convert("Asia/Kolkata")
ts_kolkata

2012-03-09 09:00:00+05:30    0.618635
2012-03-10 09:00:00+05:30   -0.596717
2012-03-11 09:00:00+05:30   -0.199900
2012-03-12 09:00:00+05:30    0.662990
2012-03-13 09:00:00+05:30    0.151880
2012-03-14 09:00:00+05:30    0.006552
dtype: float64

### Operations with Time Zone-Aware Timestamp Objects

In [314]:
stamp = pd.Timestamp("2011-03-12 04:00")
stamp_utc = stamp.tz_localize("UTC")
stamp_utc.tz_convert("Asia/Dhaka")

Timestamp('2011-03-12 10:00:00+0600', tz='Asia/Dhaka')

In [315]:
stamp_moscow = pd.Timestamp("2011-03-12 04:00", tz="Europe/Moscow")
stamp_moscow

Timestamp('2011-03-12 04:00:00+0300', tz='Europe/Moscow')

In [316]:
stamp_utc.value

1299902400000000000

In [317]:
stamp_utc.tz_convert("America/New_York").value

1299902400000000000

### Operations Between Different Time Zones

In [318]:
dates = pd.date_range("2012-03-07 09:30", periods=10, freq="B")
ts = pd.Series(np.random.standard_normal(len(dates)), index=dates)
ts

2012-03-07 09:30:00    0.221353
2012-03-08 09:30:00   -1.581276
2012-03-09 09:30:00    0.641574
2012-03-12 09:30:00    1.392631
2012-03-13 09:30:00   -0.681198
2012-03-14 09:30:00   -1.558477
2012-03-15 09:30:00    2.187467
2012-03-16 09:30:00    1.547285
2012-03-19 09:30:00   -1.018348
2012-03-20 09:30:00   -1.149032
Freq: B, dtype: float64

In [319]:
ts1 = ts[:7].tz_localize("Asia/Dhaka")
ts2 = ts1[2:].tz_convert("Europe/Moscow")
result = ts1 + ts2
result.index

DatetimeIndex(['2012-03-07 03:30:00+00:00', '2012-03-08 03:30:00+00:00',
               '2012-03-09 03:30:00+00:00', '2012-03-12 03:30:00+00:00',
               '2012-03-13 03:30:00+00:00', '2012-03-14 03:30:00+00:00',
               '2012-03-15 03:30:00+00:00'],
              dtype='datetime64[ns, UTC]', freq=None)

## 11.5 Periods and Period Arithmetic

In [320]:
p = pd.Period("2011", "Y-DEC")
p

Period('2011', 'Y-DEC')

In [321]:
p + 5

Period('2016', 'Y-DEC')

In [322]:
p - 2

Period('2009', 'Y-DEC')

In [323]:
pd.Period("2014", freq="Y-DEC") - p

In [324]:
periods = pd.period_range("2000-01-01", "2000-06-30", freq="M")
periods

PeriodIndex(['2000-01', '2000-02', '2000-03', '2000-04', '2000-05', '2000-06'], dtype='period[M]')

In [325]:
pd.Series(np.random.standard_normal(6), index=periods)

2000-01    1.334304
2000-02    1.033683
2000-03    0.046247
2000-04   -2.248215
2000-05    1.288062
2000-06    0.480494
Freq: M, dtype: float64

In [326]:
values = ["2001Q3", "2002Q2", "2003Q1"]
index = pd.PeriodIndex(values, freq="Q-DEC")
index

PeriodIndex(['2001Q3', '2002Q2', '2003Q1'], dtype='period[Q-DEC]')

### Period Frequency Conversion

In [327]:
p = pd.Period("2011", freq="Y-DEC")
p

Period('2011', 'Y-DEC')

In [328]:
p.asfreq("M", how="start")

Period('2011-01', 'M')

In [329]:
p.asfreq("M", how="end")

Period('2011-12', 'M')

In [330]:
# p.asfreq("B", how="start")

In [331]:
p = pd.Period("2011", "Y-JUN")
p

Period('2011', 'Y-JUN')

In [332]:
p.asfreq("M", how="start")

Period('2010-07', 'M')

In [333]:
p.asfreq("M", how="end")

Period('2011-06', 'M')

In [334]:
p = pd.Period("Aug-2011", "M")
p.asfreq("Y-JUN")

Period('2012', 'Y-JUN')

In [335]:
periods = pd.period_range("2006", "2009", freq="Y-DEC")
periods

PeriodIndex(['2006', '2007', '2008', '2009'], dtype='period[Y-DEC]')

In [336]:
ts = pd.Series(np.random.standard_normal(len(periods)), index=periods)
ts

2006   -1.113660
2007   -1.440498
2008    0.430050
2009    1.018706
Freq: Y-DEC, dtype: float64

In [337]:
ts.asfreq("M", how="start")

2006-01   -1.113660
2007-01   -1.440498
2008-01    0.430050
2009-01    1.018706
Freq: M, dtype: float64

In [338]:
ts.asfreq(freq="B", how="end")

C:\Users\sahor\AppData\Local\Temp\ipykernel_19904\1114802133.py:1: FutureWarning: PeriodDtype[B] is deprecated and will be removed in a future version. Use a DatetimeIndex with freq='B' instead
  ts.asfreq(freq="B", how="end")

2006-12-29   -1.113660
2007-12-31   -1.440498
2008-12-31    0.430050
2009-12-31    1.018706
Freq: B, dtype: float64

### Quarterly Period Frequencies

In [339]:
p = pd.Period("2012Q4", freq="Q-JAN")
p

Period('2012Q4', 'Q-JAN')

In [340]:
p.asfreq("D", "start")

Period('2011-11-01', 'D')

In [341]:
p.asfreq("M", how="end")

Period('2012-01', 'M')

In [342]:
p4pm = (p.asfreq("B", how="end") - 1).asfreq("min", how="start") + 16 * 600
p4pm

C:\Users\sahor\AppData\Local\Temp\ipykernel_19904\3309298150.py:1: FutureWarning: Period with BDay freq is deprecated and will be removed in a future version. Use a DatetimeIndex with BDay freq instead.
  p4pm = (p.asfreq("B", how="end") - 1).asfreq("min", how="start") + 16 * 600

Period('2012-02-05 16:00', 'min')

In [343]:
p4pm.to_timestamp()

Timestamp('2012-02-05 16:00:00')

In [344]:
periods = pd.period_range("2011Q3", "2012Q4", freq="Q-JAN")
ts = pd.Series(np.arange(len(periods)), index=periods)
ts

2011Q3    0
2011Q4    1
2012Q1    2
2012Q2    3
2012Q3    4
2012Q4    5
Freq: Q-JAN, dtype: int64

In [345]:
new_periods = (periods.asfreq("B", how="end") - 1).asfreq("h", how="start") + 16 
ts.index = new_periods.to_timestamp()
ts

C:\Users\sahor\AppData\Local\Temp\ipykernel_19904\1672470225.py:1: FutureWarning: PeriodDtype[B] is deprecated and will be removed in a future version. Use a DatetimeIndex with freq='B' instead
  new_periods = (periods.asfreq("B", how="end") - 1).asfreq("h", how="start") + 16

2010-10-28 16:00:00    0
2011-01-28 16:00:00    1
2011-04-28 16:00:00    2
2011-07-28 16:00:00    3
2011-10-28 16:00:00    4
2012-01-30 16:00:00    5
dtype: int64

### Converting Timestamps to Periods (and Back)

In [346]:
dates = pd.date_range("2000-01-01", periods=3, freq="M")
ts =pd.Series(np.random.standard_normal(3), index=dates)
ts

C:\Users\sahor\AppData\Local\Temp\ipykernel_19904\2920275210.py:1: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  dates = pd.date_range("2000-01-01", periods=3, freq="M")

2000-01-31   -0.840384
2000-02-29   -0.193121
2000-03-31    0.721032
Freq: ME, dtype: float64

In [347]:
pts = ts.to_period()
pts

2000-01   -0.840384
2000-02   -0.193121
2000-03    0.721032
Freq: M, dtype: float64

In [348]:
dates =pd.date_range("2000-01-29", periods=6)
ts2 = pd.Series(np.random.standard_normal(6), index=dates)
ts2

2000-01-29    0.281945
2000-01-30    0.388393
2000-01-31   -1.103082
2000-02-01    0.283665
2000-02-02   -0.528409
2000-02-03    1.191629
Freq: D, dtype: float64

In [349]:
ts2.to_period("M")

2000-01    0.281945
2000-01    0.388393
2000-01   -1.103082
2000-02    0.283665
2000-02   -0.528409
2000-02    1.191629
Freq: M, dtype: float64

In [350]:
pts = ts2.to_period()
pts

2000-01-29    0.281945
2000-01-30    0.388393
2000-01-31   -1.103082
2000-02-01    0.283665
2000-02-02   -0.528409
2000-02-03    1.191629
Freq: D, dtype: float64

In [351]:
pts.to_timestamp(how="end")

2000-01-29 23:59:59.999999999    0.281945
2000-01-30 23:59:59.999999999    0.388393
2000-01-31 23:59:59.999999999   -1.103082
2000-02-01 23:59:59.999999999    0.283665
2000-02-02 23:59:59.999999999   -0.528409
2000-02-03 23:59:59.999999999    1.191629
Freq: D, dtype: float64

### Creating a PeriodIndex from Arrays

In [352]:
data = pd.read_csv("examples/macrodata.csv")
data.tail()

,year,quarter,realgdp,realcons,realinv,realgovt,realdpi,cpi,m1,tbilrate,unemp,pop,infl,realint
198,2008.0,3.0,13324.600,9267.7,1990.693,991.551,9838.3,216.889,1474.7,1.17,6.0,305.270,-3.16,4.33
199,2008.0,4.0,13141.920,9195.3,1857.661,1007.273,9920.4,212.174,1576.5,0.12,6.9,305.952,-8.79,8.91
200,2009.0,1.0,12925.410,9209.2,1558.494,996.287,9926.4,212.671,1592.8,0.22,8.1,306.547,0.94,-0.71
201,2009.0,2.0,12901.504,9189.0,1456.678,1023.528,10077.5,214.469,1653.6,0.18,9.2,307.226,3.37,-3.19
202,2009.0,3.0,12990.341,9256.0,1486.398,1044.088,10040.6,216.385,1673.9,0.12,9.6,308.013,3.56,-3.44

In [353]:
data["year"]

0      1959.0
1      1959.0
2      1959.0
3      1959.0
4      1960.0
        ...
198    2008.0
199    2008.0
200    2009.0
201    2009.0
202    2009.0
Name: year, Length: 203, dtype: float64

In [354]:
data["quarter"]

0      1.0
1      2.0
2      3.0
3      4.0
4      1.0
      ...
198    3.0
199    4.0
200    1.0
201    2.0
202    3.0
Name: quarter, Length: 203, dtype: float64

In [356]:
# index = pd.PeriodIndex(year=data["year"], quarter=data["quarter"], freq="Q-DEC") # Future Error
index = pd.PeriodIndex.from_fields(
    year=data["year"], quarter=data["quarter"], freq="Q-DEC"
)
index

PeriodIndex(['1959Q1', '1959Q2', '1959Q3', '1959Q4', '1960Q1', '1960Q2',
             '1960Q3', '1960Q4', '1961Q1', '1961Q2',
             ...
             '2007Q2', '2007Q3', '2007Q4', '2008Q1', '2008Q2', '2008Q3',
             '2008Q4', '2009Q1', '2009Q2', '2009Q3'],
            dtype='period[Q-DEC]', length=203)

In [358]:
data.index = index
data.head()

,year,quarter,realgdp,realcons,realinv,realgovt,realdpi,cpi,m1,tbilrate,unemp,pop,infl,realint
1959Q1,1959.0,1.0,2710.349,1707.4,286.898,470.045,1886.9,28.98,139.7,2.82,5.8,177.146,0.00,0.00
1959Q2,1959.0,2.0,2778.801,1733.7,310.859,481.301,1919.7,29.15,141.7,3.08,5.1,177.830,2.34,0.74
1959Q3,1959.0,3.0,2775.488,1751.8,289.226,491.260,1916.4,29.35,140.5,3.82,5.3,178.657,2.74,1.09
1959Q4,1959.0,4.0,2785.204,1753.7,299.356,484.052,1931.3,29.37,140.0,4.33,5.6,179.386,0.27,4.06
1960Q1,1960.0,1.0,2847.699,1770.5,331.722,462.199,1955.5,29.54,139.6,3.50,5.2,180.007,2.31,1.19

In [359]:
data["infl"]

1959Q1    0.00
1959Q2    2.34
1959Q3    2.74
1959Q4    0.27
1960Q1    2.31
          ...
2008Q3   -3.16
2008Q4   -8.79
2009Q1    0.94
2009Q2    3.37
2009Q3    3.56
Freq: Q-DEC, Name: infl, Length: 203, dtype: float64

## 11.6 Resampling and Frequency Conversion

In [360]:
dates = pd.date_range("2000-01-01", periods=100)
ts = pd.Series(np.random.standard_normal(len(dates)), index=dates)
ts

2000-01-01   -1.531032
2000-01-02    0.173746
2000-01-03    0.418949
2000-01-04    0.485432
2000-01-05    0.508356
                ...
2000-04-05   -0.484939
2000-04-06   -0.679179
2000-04-07   -0.890618
2000-04-08    0.891579
2000-04-09    0.682147
Freq: D, Length: 100, dtype: float64

In [363]:
ts.resample("ME").mean() # Monthly end frequency

2000-01-31   -0.022153
2000-02-29   -0.050135
2000-03-31    0.195213
2000-04-30    0.090923
Freq: ME, dtype: float64

In [372]:
# ts.resample("ME", kind="periods").mean()
ts.resample("ME").mean().to_period("M")

2000-01   -0.022153
2000-02   -0.050135
2000-03    0.195213
2000-04    0.090923
Freq: M, dtype: float64

### Downsampling

In [375]:
dates = pd.date_range("2000-01-01", periods=12, freq="min")

In [376]:
ts = pd.Series(np.arange(len(dates)), index=dates)
ts

2000-01-01 00:00:00     0
2000-01-01 00:01:00     1
2000-01-01 00:02:00     2
2000-01-01 00:03:00     3
2000-01-01 00:04:00     4
2000-01-01 00:05:00     5
2000-01-01 00:06:00     6
2000-01-01 00:07:00     7
2000-01-01 00:08:00     8
2000-01-01 00:09:00     9
2000-01-01 00:10:00    10
2000-01-01 00:11:00    11
Freq: min, dtype: int64

In [380]:
ts.resample("5min").sum()

2000-01-01 00:00:00    10
2000-01-01 00:05:00    35
2000-01-01 00:10:00    21
Freq: 5min, dtype: int64

In [381]:
ts.resample("5min", closed="right").sum()

1999-12-31 23:55:00     0
2000-01-01 00:00:00    15
2000-01-01 00:05:00    40
2000-01-01 00:10:00    11
Freq: 5min, dtype: int64

In [382]:
ts.resample("5min", closed="right", label="right").sum()

2000-01-01 00:00:00     0
2000-01-01 00:05:00    15
2000-01-01 00:10:00    40
2000-01-01 00:15:00    11
Freq: 5min, dtype: int64

In [384]:
from pandas.tseries.frequencies import to_offset
result = ts.resample("5min", closed="right", label="right").sum()
result.index = result.index + to_offset("-1s")
result

1999-12-31 23:59:59     0
2000-01-01 00:04:59    15
2000-01-01 00:09:59    40
2000-01-01 00:14:59    11
Freq: 5min, dtype: int64

### Open-high-low-close (OHLC) resampling

In [385]:
ts = pd.Series(np.random.permutation(np.arange(len(dates))), index=dates)
ts

2000-01-01 00:00:00     6
2000-01-01 00:01:00     2
2000-01-01 00:02:00     9
2000-01-01 00:03:00     7
2000-01-01 00:04:00     1
2000-01-01 00:05:00     0
2000-01-01 00:06:00     4
2000-01-01 00:07:00    11
2000-01-01 00:08:00     3
2000-01-01 00:09:00     8
2000-01-01 00:10:00    10
2000-01-01 00:11:00     5
Freq: min, dtype: int64

In [386]:
ts.resample("5min").ohlc()

                     open  high  low  close
2000-01-01 00:00:00     6     9    1      1
2000-01-01 00:05:00     0    11    0      8
2000-01-01 00:10:00    10    10    5      5

### Upsampling and Interpolation

In [387]:
frame = pd.DataFrame(
    np.random.standard_normal((2, 4)),
    index=pd.date_range("2000-01-01", periods=2, freq="W-WED"),
    columns=["Colorado", "Texas", "New York", "Ohio"],
)
frame

            Colorado     Texas  New York      Ohio
2000-01-05 -0.178759  0.537327 -0.849127 -0.078367
2000-01-12  0.708019  0.011225  0.255359 -0.505124

In [388]:
df_daily = frame.resample("D").asfreq()
df_daily

            Colorado     Texas  New York      Ohio
2000-01-05 -0.178759  0.537327 -0.849127 -0.078367
2000-01-06       NaN       NaN       NaN       NaN
2000-01-07       NaN       NaN       NaN       NaN
2000-01-08       NaN       NaN       NaN       NaN
2000-01-09       NaN       NaN       NaN       NaN
2000-01-10       NaN       NaN       NaN       NaN
2000-01-11       NaN       NaN       NaN       NaN
2000-01-12  0.708019  0.011225  0.255359 -0.505124

In [389]:
frame.resample("D").ffill()

            Colorado     Texas  New York      Ohio
2000-01-05 -0.178759  0.537327 -0.849127 -0.078367
2000-01-06 -0.178759  0.537327 -0.849127 -0.078367
2000-01-07 -0.178759  0.537327 -0.849127 -0.078367
2000-01-08 -0.178759  0.537327 -0.849127 -0.078367
2000-01-09 -0.178759  0.537327 -0.849127 -0.078367
2000-01-10 -0.178759  0.537327 -0.849127 -0.078367
2000-01-11 -0.178759  0.537327 -0.849127 -0.078367
2000-01-12  0.708019  0.011225  0.255359 -0.505124

In [390]:
frame.resample("D").bfill()

            Colorado     Texas  New York      Ohio
2000-01-05 -0.178759  0.537327 -0.849127 -0.078367
2000-01-06  0.708019  0.011225  0.255359 -0.505124
2000-01-07  0.708019  0.011225  0.255359 -0.505124
2000-01-08  0.708019  0.011225  0.255359 -0.505124
2000-01-09  0.708019  0.011225  0.255359 -0.505124
2000-01-10  0.708019  0.011225  0.255359 -0.505124
2000-01-11  0.708019  0.011225  0.255359 -0.505124
2000-01-12  0.708019  0.011225  0.255359 -0.505124

In [391]:
frame.resample("D").ffill(limit=2)

            Colorado     Texas  New York      Ohio
2000-01-05 -0.178759  0.537327 -0.849127 -0.078367
2000-01-06 -0.178759  0.537327 -0.849127 -0.078367
2000-01-07 -0.178759  0.537327 -0.849127 -0.078367
2000-01-08       NaN       NaN       NaN       NaN
2000-01-09       NaN       NaN       NaN       NaN
2000-01-10       NaN       NaN       NaN       NaN
2000-01-11       NaN       NaN       NaN       NaN
2000-01-12  0.708019  0.011225  0.255359 -0.505124

In [392]:
frame.resample("W-THU").ffill()

            Colorado     Texas  New York      Ohio
2000-01-06 -0.178759  0.537327 -0.849127 -0.078367
2000-01-13  0.708019  0.011225  0.255359 -0.505124

### Resampling with Periods

In [394]:
frame = pd.DataFrame(np.random.standard_normal((24, 4)),
                     index=pd.period_range("1-2000", "12-2001", freq="M"),
                        columns=["Colorado", "Texas", "New York", "Ohio"])
frame.head()

         Colorado     Texas  New York      Ohio
2000-01 -0.353560  1.493937 -0.380898 -0.827102
2000-02 -2.595414  0.899980  1.136152  1.964929
2000-03  0.591908 -0.816047  2.183909 -1.300898
2000-04  0.960276  0.985818  0.690143  0.838467
2000-05 -1.418538  1.295556  0.795432 -1.646583

In [396]:
anual_frame = frame.resample("Y-DEC").mean()
anual_frame

      Colorado     Texas  New York      Ohio
2000 -0.327629  0.344781  0.585853 -0.046528
2001  0.257192  0.157097  0.167664 -0.091738

In [398]:
anual_frame.resample("Q-DEC").ffill()

        Colorado     Texas  New York      Ohio
2000Q1 -0.327629  0.344781  0.585853 -0.046528
2000Q2 -0.327629  0.344781  0.585853 -0.046528
2000Q3 -0.327629  0.344781  0.585853 -0.046528
2000Q4 -0.327629  0.344781  0.585853 -0.046528
2001Q1  0.257192  0.157097  0.167664 -0.091738
2001Q2  0.257192  0.157097  0.167664 -0.091738
2001Q3  0.257192  0.157097  0.167664 -0.091738
2001Q4  0.257192  0.157097  0.167664 -0.091738

In [399]:
anual_frame.resample("Q-DEC", convention="end").asfreq()

        Colorado     Texas  New York      Ohio
2000Q4 -0.327629  0.344781  0.585853 -0.046528
2001Q1       NaN       NaN       NaN       NaN
2001Q2       NaN       NaN       NaN       NaN
2001Q3       NaN       NaN       NaN       NaN
2001Q4  0.257192  0.157097  0.167664 -0.091738

In [400]:
anual_frame.resample("Q-MAR").ffill()

        Colorado     Texas  New York      Ohio
2000Q4 -0.327629  0.344781  0.585853 -0.046528
2001Q1 -0.327629  0.344781  0.585853 -0.046528
2001Q2 -0.327629  0.344781  0.585853 -0.046528
2001Q3 -0.327629  0.344781  0.585853 -0.046528
2001Q4  0.257192  0.157097  0.167664 -0.091738
2002Q1  0.257192  0.157097  0.167664 -0.091738
2002Q2  0.257192  0.157097  0.167664 -0.091738
2002Q3  0.257192  0.157097  0.167664 -0.091738

### Grouped Time Resampling

In [401]:
n = 15
times = pd.date_range("2017-05-20", periods=n, freq="1min")
df = pd.DataFrame({"time": times, "value": np.arange(n)})
df

                  time  value
0  2017-05-20 00:00:00      0
1  2017-05-20 00:01:00      1
2  2017-05-20 00:02:00      2
3  2017-05-20 00:03:00      3
4  2017-05-20 00:04:00      4
5  2017-05-20 00:05:00      5
6  2017-05-20 00:06:00      6
7  2017-05-20 00:07:00      7
8  2017-05-20 00:08:00      8
9  2017-05-20 00:09:00      9
10 2017-05-20 00:10:00     10
11 2017-05-20 00:11:00     11
12 2017-05-20 00:12:00     12
13 2017-05-20 00:13:00     13
14 2017-05-20 00:14:00     14

In [402]:
df.set_index("time").resample("5min").count()

                     value
time
2017-05-20 00:00:00      5
2017-05-20 00:05:00      5
2017-05-20 00:10:00      5

In [403]:
df2 = pd.DataFrame({"time": times.repeat(3),
                    "key": np.tile(["A", "B", "C"], n),
                    "value": np.arange(n * 3)})
df2.head()

                 time key  value
0 2017-05-20 00:00:00   A      0
1 2017-05-20 00:00:00   B      1
2 2017-05-20 00:00:00   C      2
3 2017-05-20 00:01:00   A      3
4 2017-05-20 00:01:00   B      4

In [404]:
time_key = pd.Grouper(freq="5min")
resampled = df2.set_index("time").groupby(["key", time_key]).sum()
resampled

                         value
key time
A   2017-05-20 00:00:00     30
    2017-05-20 00:05:00    105
    2017-05-20 00:10:00    180
B   2017-05-20 00:00:00     35
    2017-05-20 00:05:00    110
    2017-05-20 00:10:00    185
C   2017-05-20 00:00:00     40
    2017-05-20 00:05:00    115
    2017-05-20 00:10:00    190

In [405]:
resampled.reset_index()

  key                time  value
0   A 2017-05-20 00:00:00     30
1   A 2017-05-20 00:05:00    105
2   A 2017-05-20 00:10:00    180
3   B 2017-05-20 00:00:00     35
4   B 2017-05-20 00:05:00    110
5   B 2017-05-20 00:10:00    185
6   C 2017-05-20 00:00:00     40
7   C 2017-05-20 00:05:00    115
8   C 2017-05-20 00:10:00    190